function vle_1_2
    t = [0:0.01:1];
    g00=3350;
    R=8.31;
    P_chexane_s=@ (T) 10.^(3.17125-780.637./(T-107.29)); %давление насыщенных паров циклогексана при данной температуре
    P_methethket_s= @ (T) 10.^(3.9894-1150.2079./(T-63.904)); %давление насыщенных паров метилэтилкетона при данной температуре
    a_chexane = @( T, x) exp((1-x).^2.*g00./R./T).*x; 
    a_methethket= @(T, x) exp(x.^2.*g00./R./T).*(1-x);
    P_chexane= @ (T, x) P_chexane_s(T).*a_chexane( T, x); %парциальное давление циклогексана в системе x - мольная доля циклогексана
    P_methethket= @(T, x) P_methethket_s(T).*a_methethket(T,x); % парциальное давление хлорбензола в системе x - мольная доля циклогексана
    y = @(T, x) P_chexane(T, x)./(P_chexane(T,x)+P_methethket(T,x)); % состав пара при  x циклогексана
    P= @(T, x) P_chexane(T, x)+P_methethket(T,x); % общее давление в системе
    %figure;
    %plot(t, P(350, t.'), y(350, t.'), P(350, t.')); %pxy диаграмма при t= 350 К
    x0=t.*0+500; %вектор начальных значений температуры
    T_plot= @(x) fsolve( @(T) P(T, x)-1, x0.'); %функция расчета температуры при p=1 бар
    Y = T_plot(t.');
    y(350, 0.8)
    %figure;
    %plot(t, Y, y(Y, t.'), Y); %txy диаграмма при p=1 бан
end
